[
  {
    "id": "1",
    "title": "What computer do students need?",
    "content": "Information on the World Campus website that is specifically for our engineering programs: https://www.worldcampus.psu.edu/great-valley-programs-technical-requirements. We stress that students should NOT use a MAC as it is not supported, and students have difficulty with submissions."
  },
  {
    "id": "2",
    "title": "Are the programs STEM designated?",
    "content": "All engineering programs, including MEM, are STEM designated."
  },
  {
    "id": "3",
    "title": "How do your programs fare in the rankings?",
    "content": "Great, please visit: http://www.usnews.com/education/online-education/engineering/rankings"
  },
  {
    "id": "4",
    "title": "I have transfer credits from another school, will you evaluate them?",
    "content": "Yes. The most you can transfer in is 9 credits. They must be within the last 5 years, you must have received a grade of B or better, and the course must be substantially similar to courses in the program (a course syllabus is usually required)."
  },
  {
    "id": "5",
    "title": "My company only pays a certain amount each year, can I take more than 2 years to complete this degree?",
    "content": "You are required to enroll continuously and complete your degree in 2 years. One break is allowed, but if you anticipate needing multiple breaks, this program may not be the best fit."
  },
  {
    "id": "6",
    "title": "Will my diploma say ‘online’ or look different than others at PSU?",
    "content": "No, World Campus does not appear on the transcript. The school issuing the degree is Penn State University—School of Graduate Professional Studies. Students who take classes online have the same transcript and diplomas as those in residence."
  },
  {
    "id": "7",
    "title": "If I apply and the cohort fills, do I have to reapply for the next start date?",
    "content": "No, if the cohort fills, we will ask if you would like to start in the next available start date."
  },
  {
    "id": "8",
    "title": "Are there opportunities for individual research with the faculty?",
    "content": "Not in the online program. In our residential program in suburban Philadelphia, you can do that."
  },
  {
    "id": "9",
    "title": "I may be moving to Philadelphia, can I go back and forth between online and in residence programs?",
    "content": "We can help you move from online to resident instruction, but we cannot guarantee that you can rejoin your cohort. The same faculty teach in both programs."
  },
  {
    "id": "10",
    "title": "Is there a contact at PSU for those in the military?",
    "content": "Military Admissions Counselors can be reached at wdmilitary@outreach.psu.edu"
  },
  {
    "id": "11",
    "title": "Are exams proctored?",
    "content": "No. There are no proctored exams. You will mostly do projects, answer problems, post to discussion boards, and do group work."
  },
  {
    "id": "12",
    "title": "Will I be expected to come to PA?",
    "content": "No, there is no expectation of residency."
  },
  {
    "id": "13",
    "title": "I have financial aid questions.",
    "content": "Direct your questions to the World Campus Office of Student Aid at studentaid@outreach.psu.edu or visit http://www.worldcampus.psu.edu/tuition-and-financial-aid"
  },
  {
    "id": "14",
    "title": "What kind of time commitment is involved?",
    "content": "Going to graduate school is like having a part-time job. Each class varies but plan on 15–20 hours of work per week."
  }
]