[
  {
    "id": "1",
    "title": "Who is a good candidate?",
    "content": "We are looking for someone with strong quantitative backgrounds. Besides finance majors, students majoring in math, engineering, and economics are welcome to apply. For others, we evaluate the quantitative score in standard tests."
  },
  {
    "id": "2",
    "title": "What are some good prep courses?",
    "content": "Basic courses include business statistics, intermediate microeconomics, intermediate corporate finance, and college-level calculus."
  },
  {
    "id": "3",
    "title": "What career resources are available?",
    "content": "You have access to job search tools, salary info, networking resources, job fairs, and resume/interview workshops through PSU’s alumni association and the Nittany Network."
  },
  {
    "id": "4",
    "title": "What jobs do your graduates want to have?",
    "content": "Careers include asset or wealth management, investment or financial analysts, CFOs, and other credentialed financial roles across various industries."
  },
  {
    "id": "5",
    "title": "Start dates?",
    "content": "You can begin in either the spring or fall semesters."
  },
  {
    "id": "6",
    "title": "How flexible is this program?",
    "content": "It’s a two-year, lock-step cohort program with year-round enrollment. Students take courses in fall, spring, and summer terms."
  },
  {
    "id": "7",
    "title": "What is the capstone like?",
    "content": "Students work in teams to complete a company evaluation project."
  },
  {
    "id": "8",
    "title": "Can I transfer credits into this program?",
    "content": "Yes, up to 9 credits from another AACSB accredited institution within the last 5 years with a grade of B or better. Courses must be substantially similar."
  },
  {
    "id": "9",
    "title": "What does the transcript/diploma say?",
    "content": "Your degree will be from The Pennsylvania State University. It will not indicate online learning or World Campus."
  },
  {
    "id": "10",
    "title": "Can I get a GMAT/GRE waiver?",
    "content": "Applicants may qualify for a waiver based on GPA, advanced degree, certifications (e.g. CFA, CPA), or Beta Gamma Sigma membership. Professional experience alone does not qualify."
  },
  {
    "id": "11",
    "title": "What is the total cost of this program?",
    "content": "Tuition is approximately $34,500. Textbooks cost an additional $150–$200 per class."
  },
  {
    "id": "12",
    "title": "Is it STEM designated?",
    "content": "Yes, the program is STEM-designated. CIP code: 27.0305."
  },
  {
    "id": "13",
    "title": "How long has this program been offered?",
    "content": "In residence since 2007, and online since 2014."
  },
  {
    "id": "14",
    "title": "Who is your typical student?",
    "content": "Students come from business, math, and engineering backgrounds, including career changers with strong quantitative skills."
  },
  {
    "id": "15",
    "title": "What is the average GMAT score and GPA?",
    "content": "Average GMAT: 563; GRE: 152 verbal, 155 quant, 3.6 AWA; GPA: 3.37."
  },
  {
    "id": "16",
    "title": "What application pieces do I need to submit?",
    "content": "Application, fee, transcripts, TOEFL/IELTS (if applicable), GMAT/GRE (unless waived), resume, statement of objective, and two recommendation letters."
  },
  {
    "id": "17",
    "title": "Will this program prepare me for the CFA?",
    "content": "Yes, it covers 80–90% of CFA Level 1 and much of Level 2. CFA textbooks are used in several courses."
  },
  {
    "id": "18",
    "title": "How does this program compare to an MBA?",
    "content": "The program offers a stronger foundation in finance; it is not a general business degree like an MBA."
  },
  {
    "id": "19",
    "title": "Does this help one become a financial advisor?",
    "content": "Yes. Courses like portfolio management, real options, and financial markets analysis support this path."
  },
  {
    "id": "20",
    "title": "What are the classes like?",
    "content": "Classes are asynchronous with up to 40% teamwork. Expect math problems, videos, quizzes, and weekly modeling assignments."
  },
  {
    "id": "21",
    "title": "What are the technical requirements?",
    "content": "Details here: https://courses.worldcampus.psu.edu/public/diagnostics/tech_spec/mfin.html"
  },
  {
    "id": "22",
    "title": "I have financial aid questions.",
    "content": "Contact World Campus Student Aid: studentaid@outreach.psu.edu or visit http://www.worldcampus.psu.edu/tuition-and-financial-aid."
  },
  {
    "id": "23",
    "title": "What kind of time commitment is involved?",
    "content": "Plan for 15–20 hours of work per week per course."
  },
  {
    "id": "24",
    "title": "What are alumni doing?",
    "content": "Graduates hold jobs at Bloomberg, Vanguard, Connectiv Energy, PJM, Graystone Wealth Management, Penske, Deutsche Bank, and more."
  },
  {
    "id": "25",
    "title": "Can I do non-degree?",
    "content": "No."
  }
]